Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags
The end-detail strip flags enum.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.Shape
The shape flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.Angle
The angle flag.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.Radius
The radius flag.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.Length
The length flag.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.ThreadingType
The threading type.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.ThreadingLength
The threading length.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.ThreadingExtraFabLength
The threading extra fab length.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.Rotation
The rotation flag.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.LengthAdjustmentType
The length adjustment type flag.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.LengthAdjustmentLength
The length adjustment length flag.

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.EndType
The end type flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankingType
The cranking type flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankRotation
The crank rotation flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankStraightLength
The crank straight length flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankedLengthType
The cranked length type flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankedRatio
The cranked ratio flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankedDistance
The cranked distance flag

Tekla.Structures.Model.RebarSetExtensions.EndDetailStripFlags.CrankedOffset
The cranked offset flag